* INVESTMENT TABLES

 
** Asset table
#+TBLNAME: assets
| Investment    | Value - ZAR | Purchase (native curr) | Gain | Gain % | Value - GBP |
|---------------+-------------+------------------------+------+--------+-------------|
| Local         |      383155 |                 373901 | 9975 |   2.67 |       21051 |
| International |      322649 |                  16523 |  954 |   5.77 |       17727 |
|---------------+-------------+------------------------+------+--------+-------------|
| TOTAL         |      705804 |                        |      |   0.00 |       38778 |
#+TBLFM: @2$2=remote(saequity,@II$11)/100;%0.0f::@2$3=remote(saequity,@II$10)/100;%0.0f::@2$4=remote(saequity,@II$12)/100;%0.0f::@2$5=remote(saequity,@II$13)::@2$6=remote(saequity,@II$11)*remote(fx,@2$4)/100;%0.0f::@3$2=remote(credo,@II$2);%0.0f::@3$3=remote(credo,@II$8);%0.0f::@3$4=remote(credo,@II$9);%0.0f::@3$5=remote(credo,@II$10)::@3$6=remote(credo,@II$11);%0.0f::@4$2=vsum(@I$2..@II$2)::@4$6=vsum(@I$6..@II$6)
** South African equity
   Table is mostly in South African cents
#+TBLNAME: saequity
| Stock          | Symbol | Mkt close ZAc | Amt. | Buy - ZAc | Date Bought      |   Fees | Dividends | Div Tax | Cost ZAc | Value ZAc | Net Gain ZAc | Yield % |
|----------------+--------+---------------+------+-----------+------------------+--------+-----------+---------+----------+-----------+--------------+---------|
| Adapt IT       | ADI    |           890 |  100 |       613 | <2017-12-14 Thu> |        |           |         |    61300 |     89000 |        27700 |   45.19 |
| Famouns Brands | FBR    |         11362 |  100 |      9658 | <2017-12-14 Thu> |        |           |         |   965800 |   1136200 |       170400 |   17.64 |
| Foschini       | TFG    |         17787 |  100 |     15812 | <2017-12-14 Thu> |        |     19500 |    3900 |  1581200 |   1778700 |       213100 |   13.48 |
| Glencore       | GLN    |          6403 |  100 |      6361 |                  |        |     17997 |         |   636100 |    640300 |        22197 |    3.49 |
| Naspers        | NPN    |        340773 |  100 |    334483 |                  |        |           |         | 33448300 |  34077300 |       629000 |    1.88 |
| Old Mutual     | OML    |          2750 |  100 |      3726 | <2017-12-14 Thu> |        |     29927 |    5985 |   372600 |    275000 |       -73658 |  -19.77 |
| Zeder          | ZED    |           545 |  100 |       598 | <2017-12-14 Thu> |        |     18260 |    3652 |    59800 |     54500 |         9308 |   15.57 |
| Quilter        | QUI    |          2645 |  100 |      2650 | <2018-06-25 Mon> |        |           |         |   265000 |    264500 |         -500 |   -0.19 |
|----------------+--------+---------------+------+-----------+------------------+--------+-----------+---------+----------+-----------+--------------+---------|
| TOTAL          |        |             0 |      |         0 |                  | 159600 |     85684 |         | 37390100 |  38315500 |       997547 |    2.67 |
#+TBLFM: $10=$4*$5::$11=$4*$3::$12=$11-$10+$8-$9-$7::$13=($12/$10)*100;%0.2f::@4$12=@4$11-@4$10+@4$8-@4$9-@4$7::@5$12=@5$11-@5$10+@5$8-@5$9-@5$7::@7$12=@7$11-@7$10+@7$8-@7$9-@7$7::@8$12=@8$11-@8$10+@8$8-@8$9-@8$7::@10$7=17100*4+9120*10::@10$10=vsum(@2$10..@9$10)::@10$11=vsum(@2$11..@9$11);%0.0f::@10$12=vsum(@I$12..@9$12);%0.0f

** International investments
   Table is mostly based in GBP
#+TBLNAME: credo
| Investment     | Value - ZAR | Market Close | Amt. |    Buy | Fees | Dividends | Purchased @ | Gain | % Gain | Value - GBP |
|----------------+-------------+--------------+------+--------+------+-----------+-------------+------+--------+-------------|
| Cash - Dollars |        1383 |       0.7615 |  100 |        |      |           |           0 |      |        |          76 |
| Cash - GBP     |        1820 |            1 |  100 |        |      |           |           0 |      |        |         100 |
| Global Equity  |      277438 |      152.430 |  100 | 140.65 |      |           |       14065 | 1178 |   8.38 |       15243 |
| Japanese       |       42008 |       23.075 |  100 |  24.58 |      |           |        2458 | -150 |  -6.10 |        2308 |
|----------------+-------------+--------------+------+--------+------+-----------+-------------+------+--------+-------------|
| TOTAL          |      322649 |     18.17588 |      |        |  250 |         0 |       16523 |  954 |   5.77 |       17727 |
#+TBLFM: $8=$5*$4;%0.0f::$11=@3$4*@3$2::@2$2=@2$11*remote(fx,@4$2);%0.0f::@2$3=remote(fx,@2$3);%0.4f::@2$11=@2$3*@2$4;%0.0f::@3$2=remote(fx,@4$2)*@3$11;%0.0f::@3$11=@3$3*@3$4;%0.0f::@4$2=@4$11*remote(fx,@4$2);%0.0f::@4$9=@4$11-@4$8-@4$6+@4$7;%0.0f::@4$10=(@4$9/@4$8)*100;%0.2f::@4$11=@4$3*@4$4;%0.0f::@5$2=@5$11*remote(fx,@4$2);%0.0f::@5$9=@5$11-@5$8-@5$6+@5$7;%0.0f::@5$10=(@5$9/@5$8)*100;%0.2f::@5$11=@5$3*@5$4;%0.0f::@6$2=vsum(@I$2..@II$2);%0.0f::@6$6=250+vsum(@I$6..@II$6)::@6$7=vsum(@I$7..@5$7)::@6$8=vsum(@I$8..@II$8)::@6$9=@6$11-@6$8-@6$6+@6$7;%0.0f::@6$10=(@II$9/@II$8)*100;%0.2f::@6$11=vsum(@I$11..@II$11);%0.0f

** Foreign exchange rate matrix
#+TBLNAME: fx
| From |     GBP-> |    USD-> |    ZAR-> |
|------+-----------+----------+----------|
| GBP  |         1 | 0.761470 | 0.054942 |
| USD  |           |        1 |          |
| ZAR  | 18.200996 |          |        1 |
#+TBLFM: @2$3='(format "%0.6f" usd2gbp)::@2$4='(format "%0.6f" zar2gbp)::@4$2='(format "%0.6f" gbp2zar)


* SUPPORT CODE
** Before
   
*** Call exchange rates
#+BEGIN_SRC emacs-lisp
(require 'request)
(require 'json)
(require 'cl)
(request
 "http://data.fixer.io/api/latest"
 :params `(("access_key" . "0acd3b4df220839b570d914619f8dfd8")
           ("symbols" . "USD\,GBP\,ZAR"))
 :parser 'json-read
 :success (function* 
 (lambda (&key data &allow-other-keys)
 (let-alist data
 (let ((usd .rates.USD)
 (zar .rates.ZAR)
 (gbp .rates.GBP))
 (setq gbp2zar (/ zar gbp))
 (setq usd2gbp (/ gbp usd))
 (setq zar2gbp (/ gbp zar)))
 (org-table-iterate-buffer-table)))))
 #+END_SRC

#+RESULTS:
: [cl-struct-request-response nil nil nil nil nil "http://data.fixer.io/api/latest?access_key=0acd3b4df220839b570d914619f8dfd8&symbols=USD%2CGBP%2CZAR" nil (:params (("access_key" . "0acd3b4df220839b570d914619f8dfd8") ("symbols" . "USD,GBP,ZAR")) :parser json-read :success (lambda (&rest --cl-rest--) "
: 
: (fn &key DATA &allow-other-keys)" (let* ((data (car (cdr (plist-member --cl-rest-- (quote :data)))))) (let-alist data (let ((usd \.rates\.USD) (zar \.rates\.ZAR) (gbp \.rates\.GBP)) (setq gbp2zar (/ zar gbp)) (setq usd2gbp (/ gbp usd)) (setq zar2gbp (/ gbp zar))) (org-table-iterate-buffer-table)))) :error #[128 "\302\300\303\301\"\"\207" [request-default-error-callback ("http://data.fixer.io/api/latest") apply append] 6 "
: 
: (fn &rest ARGS2)"] :url "http://data.fixer.io/api/latest?access_key=0acd3b4df220839b570d914619f8dfd8&symbols=USD%2CGBP%2CZAR" :response #0) #<buffer  *request curl*> nil nil curl nil]






*** Call saequity quotes
(require 'request)
(require 'json)
(require 'cl)
(request
 "http://finance.yahoo.com/api/latest"
 :params `(("access_key" . "0acd3b4df220839b570d914619f8dfd8")
           ("symbols" . "USD\,GBP\,ZAR"))
 :parser 'json-read
 :success (function* 
 (lambda (&key data &allow-other-keys)
 (let-alist data
 (let ((usd .rates.USD)
 (zar .rates.ZAR)
 (gbp .rates.GBP))
 (setq gbp2zar (/ zar gbp))
 (setq usd2gbp (/ gbp usd))
 (setq zar2gbp (/ gbp zar)))
 (org-table-iterate-buffer-table)))))


** After
*** Sql script
#+NAME: create-asset-table
#+BEGIN_SRC sql :engine postgres :dbhost 192.168.1.100 :dbuser boris :dbpassword work :database assets

CREATE TABLE phonebook(date DATE, total-zar INTEGER, total-gbp INTEGER, intnl-zar, intnl-gbp,local-zar,local-gbp);

